huhazhou/s32k/bl/SPI_MSD0_Driver.c
/* LPSPI.c              (c) 2016 NXP 
 * Descriptions: S32K144 FlexCAN example functions.
 * May 31 2016 S. Mihalik: Initial version.
 * Oct 31 2016 SM - adjust PRESCALE for 40 MHz SPLLDIV2_CLK
 * Nov 02 2016 SM - cleared flags in transmit, receive functions
 */
#include "S32K144.h"           /* include peripheral declarations S32K144 */
#include <stdio.h>
#include "SPI_MSD0_Driver.h"

MSD_CARDINFO SD0_CardInfo;

/*******************************************************************************
 * Function Name  : MSD0_spi_read_write
 * Description    : None
 * Input          : - data:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
int MSD0_spi_read_write(unsigned char data) {
	unsigned char recieve = 0;

	while ((LPSPI0->SR & LPSPI_SR_TDF_MASK) >> LPSPI_SR_TDF_SHIFT == 0)
		; /* Wait for Tx FIFO available */
	LPSPI0->TDR = data; /* Transmit data */
	LPSPI0->SR |= LPSPI_SR_TDF_MASK; /* Clear TDF flag */

	while ((LPSPI0->SR & LPSPI_SR_RDF_MASK) >> LPSPI_SR_RDF_SHIFT == 0)
		; /* Wait at least one RxFIFO entry */
	recieve = LPSPI0->RDR; /* Read received data */
	LPSPI0->SR |= LPSPI_SR_RDF_MASK; /* Clear RDF flag */
	return recieve;

}
void writeclock(uint8_t cnt)
{
	uint8_t i;
	//CS_HIGH;
	for(i=0;i<cnt;i++)
		MSD0_spi_read_write(0xff);
	//CS_HIGH;
}

/*******************************************************************************
 * Function Name  : MSD0_SPIHighSpeed
 * Description    : SD Card Speed Set
 * Input          : - b_high: 1 = 18MHz, 0 = 281.25Hz
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
void MSD0_SPIHighSpeed(unsigned char b_high) {

	/* Speed select */
	if (b_high == 0) {
		LPSPI0->TCR &= 0xc7ffffff;
		LPSPI0->TCR |= 0x38000000;
	} else {
		LPSPI0_init_master();

	}

}

/*******************************************************************************
 * Function Name  : MSD0_Init
 * Description    : SD Card initializtion
 * Input          : None
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
int MSD0_Init(void) {
	unsigned char r1;
	unsigned char buff[6] = { 0 };
	unsigned short retry;
	/* Satrt send 74 clocks at least */
	for (retry = 0; retry < 80; retry++) {
		MSD0_spi_read_write(DUMMY_BYTE);
	}
	//writeclock(10);
	MSD0_card_disable();
	/* Start send CMD0 till return 0x01 means in IDLE state */
	for (retry = 0; retry < 0xFFF; retry++) {
		r1 = MSD0_send_command(CMD0, 0, 0x95);//r1 hui fu shi 0x80bushi 0x01
		//MSD0_spi_read_write(r1);
		if (r1 == 0x01) {
			retry = 0;
			break;
		}
	}
	/* Timeout return */
	if (retry == 0xFFF) {
		return 1;
	}
	/* Get the card type, version */
	r1 = MSD0_send_command_hold(CMD8, 0x1AA, 0x87);
	/* r1=0x05 -> V1.0 */
	if (r1 == 0x05) {
		SD0_CardInfo.CardType = CARDTYPE_SDV1;
		/* End of CMD8, chip disable and dummy byte */
		MSD0_card_disable();
		MSD0_spi_read_write(DUMMY_BYTE);

		/* SD1.0/MMC start initialize */
		/* Send CMD55+ACMD41, No-response is a MMC card, otherwise is a SD1.0 card */
		for (retry = 0; retry < 0xFFF; retry++) {
			r1 = MSD0_send_command(CMD55, 0, 0); /* should be return 0x01 */
			if (r1 != 0x01) {
				MSD0_spi_read_write(0xa7);
				return r1;
			}
			r1 = MSD0_send_command(ACMD41, 0, 0); /* should be return 0x00 */
			if (r1 == 0x00) {
				retry = 0;
				break;
			}
			MSD0_spi_read_write(0x5a);
		}

		/* MMC card initialize start */
		if (retry == 0xFFF) {
			for (retry = 0; retry < 0xFFF; retry++) {
				r1 = MSD0_send_command(CMD1, 0, 0); /* should be return 0x00 */
				if (r1 == 0x00) {
					retry = 0;
					break;
				}
			}

			/* Timeout return */
			if (retry == 0xFFF) {
				return 2;
			}

			SD0_CardInfo.CardType = CARDTYPE_MMC;
		}
		/* SD1.0 card detected, print information */

		/* Set spi speed high */
		MSD0_SPIHighSpeed(1);

		/* CRC disable */
		r1 = MSD0_send_command(CMD59, 0, 0x01);
		if (r1 != 0x00) {
			return r1; /* response error, return r1 */
		}

		/* Set the block size */
		r1 = MSD0_send_command(CMD16, MSD_BLOCKSIZE, 0xFF);
		if (r1 != 0x00) {
			return r1; /* response error, return r1 */
		}
	}

	/* r1=0x01 -> V2.x, read OCR register, check version */
	else if (r1 == 0x01) {
		/* 4Bytes returned after CMD8 sent	*/
		buff[0] = MSD0_spi_read_write(DUMMY_BYTE); /* should be 0x00 */
		buff[1] = MSD0_spi_read_write(DUMMY_BYTE); /* should be 0x00 */
		buff[2] = MSD0_spi_read_write(DUMMY_BYTE); /* should be 0x01 */
		buff[3] = MSD0_spi_read_write(DUMMY_BYTE); /* should be 0xAA */

		/* End of CMD8, chip disable and dummy byte */
		MSD0_card_disable();
		MSD0_spi_read_write(DUMMY_BYTE);
		/* Check voltage range be 2.7-3.6V	*/
		if (buff[2] == 0x01 && buff[3] == 0xAA) {
			for (retry = 0; retry < 0xFFF; retry++) {
				r1 = MSD0_send_command(CMD55, 0, 0); /* should be return 0x01 */
				if (r1 != 0x01) {
					return r1;
				}

				r1 = MSD0_send_command(ACMD41, 0x40000000, 0); /* should be return 0x00 */
				if (r1 == 0x00) {
					retry = 0;
					break;
				}
			}

			/* Timeout return */
			if (retry == 0xFFF) {
				return 3;
			}

			/* Read OCR by CMD58 */
			r1 = MSD0_send_command_hold(CMD58, 0, 0);
			if (r1 != 0x00) {
				return r1; /* response error, return r1 */
			}

			buff[0] = MSD0_spi_read_write(DUMMY_BYTE);
			buff[1] = MSD0_spi_read_write(DUMMY_BYTE);
			buff[2] = MSD0_spi_read_write(DUMMY_BYTE);
			buff[3] = MSD0_spi_read_write(DUMMY_BYTE);

			/* End of CMD58, chip disable and dummy byte */
			MSD0_card_disable();
			MSD0_spi_read_write(DUMMY_BYTE);

			/* OCR -> CCS(bit30)  1: SDV2HC	 0: SDV2 */
			if (buff[0] & 0x40) {
				SD0_CardInfo.CardType = CARDTYPE_SDV2HC;
			} else {
				SD0_CardInfo.CardType = CARDTYPE_SDV2;
			}
			/* Set spi speed high */
			MSD0_SPIHighSpeed(1);
		}
	}
	return 0;
}

