huhazhou/s32k/bl/SPI_MSD0_Driver.c
  return 0;
}
/*******************************************************************************
 * Function Name  : MSD0_ReadSingleBlock
 * Description    : None
 * Input          : - sector:
 *				   - buffer:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
int MSD0_ReadSingleBlock(unsigned int sector, unsigned char *buffer)
{
  unsigned char r1;

  /* if ver = SD2.0 HC, sector need <<9 */
  if(SD0_CardInfo.CardType != CARDTYPE_SDV2HC)
  {
	 sector = sector<<9;
  }

  /* Send CMD17 : Read single block command */
  r1 = MSD0_send_command(CMD17, sector, 0);

  if(r1 != 0x00)
  {
	 return 1;
  }

  /* Start read and return the result */
  r1 = MSD0_read_buffer(buffer, MSD_BLOCKSIZE, RELEASE);

  /* Send stop data transmit command - CMD12 */
  MSD0_send_command(CMD12, 0, 0);

  return r1;
}


/*******************************************************************************
 * Function Name  : MSD0_ReadMultiBlock
 * Description    : None
 * Input          : - sector:
 *				   - buffer:
 *                  - NbrOfSector:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
int MSD0_ReadMultiBlock(unsigned int sector, unsigned char *buffer, unsigned int NbrOfSector)
{
  unsigned char r1;
  register unsigned int i;

  /* if ver = SD2.0 HC, sector need <<9 */
  if(SD0_CardInfo.CardType != CARDTYPE_SDV2HC)
  {
	 sector = sector<<9;
  }

  /* Send CMD18 : Read multi block command */
  r1 = MSD0_send_command(CMD18, sector, 0);
  if(r1 != 0x00)
  {
     return 1;
  }

  /* Start read	*/
  for(i=0; i<NbrOfSector; i++)
  {
     if(MSD0_read_buffer(buffer+i*MSD_BLOCKSIZE, MSD_BLOCKSIZE, HOLD))
     {
		 /* Send stop data transmit command - CMD12	*/
		 MSD0_send_command(CMD12, 0, 0);
		 /* chip disable and dummy byte */
		 MSD0_card_disable();
		 return 2;
     }
  }

  /* Send stop data transmit command - CMD12 */
  MSD0_send_command(CMD12, 0, 0);

  /* chip disable and dummy byte */
  MSD0_card_disable();
  MSD0_spi_read_write(DUMMY_BYTE);

  return 0;
}

/*******************************************************************************
 * Function Name  : MSD0_WriteSingleBlock
 * Description    : None
 * Input          : - sector:
 *				   - buffer:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
int MSD0_WriteSingleBlock(unsigned int sector, unsigned char *buffer)
{
  unsigned char r1;
  register unsigned short i;
  unsigned int retry;

  /* if ver = SD2.0 HC, sector need <<9 */
  if(SD0_CardInfo.CardType != CARDTYPE_SDV2HC)
  {
	  sector = sector<<9;
  }

  /* Send CMD24 : Write single block command */
  r1 = MSD0_send_command(CMD24, sector, 0);
  if(r1 != 0x00)
  {
	 return 1;
  }

  /* Card enable, Prepare to write */
  MSD0_card_enable();
  MSD0_spi_read_write(DUMMY_BYTE);
  MSD0_spi_read_write(DUMMY_BYTE);
  MSD0_spi_read_write(DUMMY_BYTE);
  /* Start data write token: 0xFE */
  MSD0_spi_read_write(0xFE);

  /* Start single block write the data buffer */
  for(i=0; i<MSD_BLOCKSIZE; i++)
  {
    MSD0_spi_read_write(*buffer++);
  }

  /* 2Bytes dummy CRC */
  MSD0_spi_read_write(DUMMY_BYTE);
  MSD0_spi_read_write(DUMMY_BYTE);

  /* MSD card accept the data */
  r1 = MSD0_spi_read_write(DUMMY_BYTE);
  if((r1&0x1F) != 0x05)
  {
    MSD0_card_disable();
    return 2;
  }

  /* Wait all the data programm finished */
  retry = 0;
  while(MSD0_spi_read_write(DUMMY_BYTE) == 0x00)
  {
	 /* Timeout return */
	 if(retry++ == 0x40000)
	 {
	    MSD0_card_disable();
	    return 3;
	 }
  }

  /* chip disable and dummy byte */
  MSD0_card_disable();
  MSD0_spi_read_write(DUMMY_BYTE);

  return 0;
}

/*******************************************************************************
 * Function Name  : MSD0_WriteMultiBlock
 * Description    : None
 * Input          : - sector:
 *				   - buffer:
 *                  - NbrOfSector:
 * Output         : None
 * Return         : None
 * Attention		 : None
 *******************************************************************************/
int MSD0_WriteMultiBlock(unsigned int sector, unsigned char *buffer, unsigned int NbrOfSector)
{
  unsigned char r1;
  register unsigned short i;
  register unsigned int n;
  unsigned int retry;

  /* if ver = SD2.0 HC, sector need <<9 */
  if(SD0_CardInfo.CardType != CARDTYPE_SDV2HC)
  {
	  sector = sector<<9;
  }

  /* Send command ACMD23 berfore multi write if is not a MMC card */
  if(SD0_CardInfo.CardType != CARDTYPE_MMC)
  {
	  MSD0_send_command(ACMD23, NbrOfSector, 0x00);
  }

  /* Send CMD25 : Write nulti block command	*/
  r1 = MSD0_send_command(CMD25, sector, 0);

  if(r1 != 0x00)
  {
	  return 1;
  }

  /* Card enable, Prepare to write */
  MSD0_card_enable();
  MSD0_spi_read_write(DUMMY_BYTE);
  //MSD0_spi_read_write(DUMMY_BYTE);
  //MSD0_spi_read_write(DUMMY_BYTE);

  for(n=0; n<NbrOfSector; n++)
  {
	 /* Start multi block write token: 0xFC */
	 MSD0_spi_read_write(0xFC);

	 for(i=0; i<MSD_BLOCKSIZE; i++)
	 {
		MSD0_spi_read_write(*buffer++);
	 }

	 /* 2Bytes dummy CRC */
	 MSD0_spi_read_write(DUMMY_BYTE);
	 MSD0_spi_read_write(DUMMY_BYTE);

	 /* MSD card accept the data */
	 r1 = MSD0_spi_read_write(DUMMY_BYTE);
	 if((r1&0x1F) != 0x05)
	 {
	    MSD0_card_disable();
	    return 2;
	 }

	 /* Wait all the data programm finished	*/
	 retry = 0;
	 while(MSD0_spi_read_write(DUMMY_BYTE) != 0xFF)
	 {
		/* Timeout return */
		if(retry++ == 0x40000)
		{
		   MSD0_card_disable();
		   return 3;
		}
	 }
  }

  /* Send end of transmit token: 0xFD */
  r1 = MSD0_spi_read_write(0xFD);
  if(r1 == 0x00)
  {
	 return 4;
  }

  /* Wait all the data programm finished */
  retry = 0;
  while(MSD0_spi_read_write(DUMMY_BYTE) != 0xFF)
  {
	 /* Timeout return */
	 if(retry++ == 0x40000)
	 {
	     MSD0_card_disable();
	     return 5;
	 }
  }

  /* chip disable and dummy byte */
  MSD0_card_disable();
  MSD0_spi_read_write(DUMMY_BYTE);

