huhazhou/s32k/bl/SPI_MSD0_Driver.c
  return 0;
}

/*******************************************************************************
 * Function Name  : MSD0_send_command
 * Description    : None
 * Input          : - cmd:
 *				   - arg:
 *                  - crc:
 * Output         : None
 * Return         : R1 value, response from card
 * Attention		 : None
 *******************************************************************************/
int MSD0_send_command(unsigned char cmd, unsigned int arg, unsigned char crc) {
	unsigned char r1;
	unsigned char retry;

	/* Dummy byte and chip enable */
	//CS_LOW;
	MSD0_spi_read_write(DUMMY_BYTE);
	//CS_HIGH;
	MSD0_card_enable();

	/* Command, argument and crc */
	//CS_LOW;
	MSD0_spi_read_write(cmd | 0x40);
	MSD0_spi_read_write(arg >> 24);
	MSD0_spi_read_write(arg >> 16);
	MSD0_spi_read_write(arg >> 8);
	MSD0_spi_read_write(arg);
	MSD0_spi_read_write(crc);
	//CS_HIGH;
	/* Wait response, quit till timeout */
	for (retry = 0; retry < 200; retry++) {
		//CS_LOW;
		r1 = MSD0_spi_read_write(DUMMY_BYTE);
		//CS_HIGH;
		if (r1 != 0xFF) {
			//CS_LOW;
			//MSD0_spi_read_write(0xa5);
			//MSD0_spi_read_write(r1);

			//CS_HIGH;
			break;
		}
	}
	//MSD0_spi_read_write(0xa6);
	/* Chip disable and dummy byte */
	MSD0_card_disable();
	MSD0_spi_read_write(DUMMY_BYTE);

	return r1;
}

/*******************************************************************************
 * Function Name  : MSD0_send_command_hold
 * Description    : None
 * Input          : - cmd:
 *				   - arg:
 *                  - crc:
 * Output         : None
 * Return         : R1 value, response from card
 * Attention		 : None
 *******************************************************************************/
int MSD0_send_command_hold(unsigned char cmd, unsigned int arg,
		unsigned char crc) {
	unsigned char r1;
	unsigned char retry;

	/* Dummy byte and chip enable */
	MSD0_spi_read_write(DUMMY_BYTE);
	MSD0_card_enable();

	/* Command, argument and crc */
	MSD0_spi_read_write(cmd | 0x40);
	MSD0_spi_read_write(arg >> 24);
	MSD0_spi_read_write(arg >> 16);
	MSD0_spi_read_write(arg >> 8);
	MSD0_spi_read_write(arg);
	MSD0_spi_read_write(crc);

	/* Wait response, quit till timeout */
	for (retry = 0; retry < 200; retry++) {
		r1 = MSD0_spi_read_write(DUMMY_BYTE);
		if (r1 != 0xFF) {
			break;
		}
	}

	return r1;
}

void LPSPI0_init_master(void) {
	PCC->PCCn[PCC_PORTE_INDEX] |= PCC_PCCn_CGC_MASK; /* Enable clock for PORTB */
	PORTE->PCR[0] |= PORT_PCR_MUX(2); /* Port B14: MUX = ALT3, LPSPI1_SCK */
	PORTE->PCR[1] |= PORT_PCR_MUX(2); /* Port B15: MUX = ALT3, LPSPI1_SIN */
	PORTE->PCR[2] |= PORT_PCR_MUX(2); /* Port B16: MUX = ALT3, LPSPI1_SOUT */
	PORTE->PCR[6] |= PORT_PCR_MUX(2); /* Port B17: MUX = ALT3, LPSPI1_PCS3 */

	//PTE->PDDR |= 1<<6; /* Port D0: Data Direction= output */
	//PORTE->PCR[6] = 0x00000100; /* Port D0: MUX = GPIO */

	PCC->PCCn[PCC_LPSPI0_INDEX] = 0; /* Disable clocks to modify PCS ( default) */
	PCC->PCCn[PCC_LPSPI0_INDEX] = 0xC6000000; /* Enable PCS=SPLL_DIV2 (40 MHz func'l clock) */
	LPSPI0->CR = 0x00000000; /* Disable module for configuration */
	LPSPI0->IER = 0x00000000; /* Interrupts not used */
	LPSPI0->DER = 0x00000000; /* DMA not used */
	LPSPI0->CFGR0 = 0x00000000; /* Defaults: */
	/* RDM0=0: rec'd data to FIFO as normal */
	/* CIRFIFO=0; Circular FIFO is disabled */
	/* HRSEL, HRPOL, HREN=0: Host request disabled */
	LPSPI0->CFGR1 = 0x00000001; /* Configurations: master mode*/
	/* PCSCFG=0: PCS[3:2] are enabled */
	/* OUTCFG=0: Output data retains last value when CS negated */
	/* PINCFG=0: SIN is input, SOUT is output */
	/* MATCFG=0: Match disabled */
	/* PCSPOL=0: PCS is active low */
	/* NOSTALL=0: Stall if Tx FIFO empty or Rx FIFO full */
	/* AUTOPCS=0: does not apply for master mode */
	/* SAMPLE=0: input data sampled on SCK edge */
	/* MASTER=1: Master mode */
	LPSPI0->TCR = 0xd2000007; /*zi ji kong zhi cs*/
	/* Transmit cmd: PCS3, 16 bits, prescale func'l clk by 4, etc*/
	/* CPOL=0: SCK inactive state is low */
	/* CPHA=1: Change data on SCK lead'g, capture on trail'g edge*/
	/* PRESCALE=128: Functional clock divided by 128**2 = 256 */
	/* PCS=3: Transfer using PCS3 */
	/* LSBF=0: Data is transfered MSB first */
	/* BYSW=0: Byte swap disabled */
	/* CONT, CONTC=0: Continuous transfer disabled */
	/* RXMSK=0: Normal transfer: rx data stored in rx FIFO */
	/* TXMSK=0: Normal transfer: data loaded from tx FIFO */
	/* WIDTH=0: Single bit transfer */
	/* FRAMESZ=15: # bits in frame = 15+1=16 */
	LPSPI0->CCR = 0x04090808; /* Clock dividers based on prescaled func'l clk of 100 nsec */
	/* SCKPCS=4: SCK to PCS delay = 4+1 = 5 (500 nsec) */
	/* PCSSCK=4: PCS to SCK delay = 9+1 = 10 (1 usec) */
	/* DBT=8: Delay between Transfers = 8+2 = 10 (1 usec) */
	/* SCKDIV=8: SCK divider =8+2 = 10 (1 usec: 1 MHz baud rate) */
	LPSPI0->FCR = 0x00000003; /* RXWATER=0: Rx flags set when Rx FIFO >0 */
	/* TXWATER=3: Tx flags set when Tx FIFO <= 3 */
	LPSPI0->CR = 0x00000009; /* Enable module for operation */
	/* DBGEN=1: module enabled in debug mode */
	/* DOZEN=0: module enabled in Doze mode */
	/* RST=0: Master logic not reset */
	/* MEN=1: Module is enabled */
}

void LPSPI0_transmit_8bits(uint8_t send) {
	while ((LPSPI0->SR & LPSPI_SR_TDF_MASK) >> LPSPI_SR_TDF_SHIFT == 0)
		;
	/* Wait for Tx FIFO available */
	LPSPI0->TDR = send; /* Transmit data */
	LPSPI0->SR |= LPSPI_SR_TDF_MASK; /* Clear TDF flag */
}
uint8_t LPSPI0_receive_8bits(void) {
	uint8_t receive = 0;
	while ((LPSPI0->SR & LPSPI_SR_RDF_MASK) >> LPSPI_SR_RDF_SHIFT == 0)
		;
	/* Wait at least one RxFIFO entry */
	receive = LPSPI0->RDR; /* Read received data */
	LPSPI0->SR |= LPSPI_SR_RDF_MASK; /* Clear RDF flag */
	return receive; /* Return received data */
}
void LPSPI1_transmit_16bits(uint16_t send) {
	while ((LPSPI0->SR & LPSPI_SR_TDF_MASK) >> LPSPI_SR_TDF_SHIFT == 0)
		;
	/* Wait for Tx FIFO available */
	LPSPI0->TDR = send; /* Transmit data */
	LPSPI0->SR |= LPSPI_SR_TDF_MASK; /* Clear TDF flag */
}
uint16_t LPSPI1_receive_16bits(void) {
	uint16_t receive = 0;
	while ((LPSPI0->SR & LPSPI_SR_RDF_MASK) >> LPSPI_SR_RDF_SHIFT == 0)
		;
	/* Wait at least one RxFIFO entry */
	receive = LPSPI0->RDR; /* Read received data */
	LPSPI0->SR |= LPSPI_SR_RDF_MASK; /* Clear RDF flag */
	return receive; /* Return received data */
}
